---
kind: property
id: P:Autodesk.Revit.DB.Analysis.Polyloop.Direction
source: html/46b603e3-ff86-3bf4-9a16-0ecc360ae2a8.htm
---
# Autodesk.Revit.DB.Analysis.Polyloop.Direction Property

The direction for the outward normal for this polygon.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```